docs: mermaid diagrams + ssot naming alignment (#309)
* doc fix 1

* docs: align ArangoDB references
